const id = "12steps-group-aiz.mdoc";
						const collection = "posts";
						const slug = "12steps-group-aiz";
						const body = "\n**Добро пожаловать вместе 📘**\n\n🔥 вычитывать перевод БК АА и собирать свой перевод\n\n🔥 смотреть, как описана в ней программа 12 шагов 🫶\n\n🏵 Первая встреча запланирована на этот вторник\n\n9 мая с **16.15-17.30** Мск\n\nДалее - каждый вторник с **16.15**\n\nЖивая + созвон в тг\n\n🌏 Адрес группы: [Москва, Столешников пер., 2-4](https://2gis.ru/moscow/search/Столешников%20пер.%2C%20д.%202-4), Храм, 215 комн (на входе в Храм можете спросить у дежурных как пройти).\n\n**ТГ** 📲 [t.me/solutionof12steps](t.me/solutionof12steps)\n\n**Там уже есть:**\n\n- 🌳 ссылки на словари, какие рекомендую использовать дабы прояснить значение интересующих вас слов.\n- 🌳 пдф русского и англ текста БК (перевод неутвержденный)\n\n#### Нужна помощь и служения:\n\n- 🎾 подключить комп к проектору\n- 🎾 казначей (онлайн и на живой)\n- 🎾 админ чата\n- 🎾 дублер ведущего\n- 🎾 спикерхантер\n- 🎾 секретарь\n- 🎾 Привлечение в чатах\n- 🎾 другие\n";
						const data = {title:"Добро пожаловать вместе в БКАА",description:"Группа АИЗ по 12 шагам БКАА",pubDate:"05.09.2023",img:"https://www.wealthmanagement.com/sites/wealthmanagement.com/files/aa-meeting.jpg"};
						const _internal = {
							type: 'content',
							filePath: "/Users/samgold/Desktop/Проекты/itaa/src/content/posts/12steps-group-aiz.mdoc",
							rawData: "\ntitle: 'Добро пожаловать вместе в БКАА'\ndescription: 'Группа АИЗ по 12 шагам БКАА'\n\npubDate: '05.09.2023'\nimg: 'https://www.wealthmanagement.com/sites/wealthmanagement.com/files/aa-meeting.jpg'",
						};

export { _internal, body, collection, data, id, slug };
