import { d as createComponent, r as renderTemplate, g as renderComponent, u as unescapeHTML } from './astro_321cb245.mjs';
import 'clsx';
import { $ as $$Post } from './prerender_6e6735f4.mjs';
import 'html-escaper';
/* empty css                          *//* empty css                           */import './astro-assets-services_17197a4f.mjs';
/* empty css                                                               *//* empty css                                                               *//* empty css                                                             *//* empty css                                                             *//* empty css                         *//* empty css                            *//* empty css                          *//* empty css                                                               */
const html = "<p>Мы рады, что вы нашли эту страницу и слышите новость о том, что есть надежда для интернет-пользователей и пользователей технологий. Если вы близки к Интернет-зависимым, вы, вероятно, уже знаете о трудностях и боли, которые может вызвать это состояние, не только для самих зависимых, но и для окружающих их людей. Зависимость является серьезной проблемой, которая вредна для всех, кого она касается.</p>\n<p>Во-первых, никто не несет ответственности за чье-либо компульсивное использование Интернета и технологий. Как гласит лозунг Ал-Анона: «Я не вызвал это, я не могу контролировать это, и я не могу вылечить это».</p>\n<p>Вы не вызвали это. Некоторые люди частично обвиняют себя в неблагополучном поведении членов своей семьи, особенно с зависимыми, которые очень быстро снимают с себя ответственность и обвиняют других. Возможно, вы проводили время в онлайне со своим любимым человеком, купили ему компьютер или смартфон или поощрили их занятия, думая, что это безобидный досуг. Возможно, вы были вовлечены в какой-то конфликт и хотите знать, не заставило ли это их спрятаться вашего зависимого в Интернете. Но никто не несет ответственности за поведение другого человека или психические расстройства.</p>\n<p>Вы не можете это контролировать. Возможно, вы уже пытались поговорить со своим другом или членом семьи. Возможно, вы торговались с ними или ставили ультиматумы. Вы пытались помочь им увидеть, какой вред они наносят себе и другим. И ничего из этого не сработало. Это сбивает с толку вас. Почему они ничего не понимают и не заботятся о себе? Почему они не могут видеть то, что для вас очевидно? Это на самом деле симптом болезни зависимости.</p>\n<p>Вы не можете вылечить это. Мы все хотели бы верить, что у нас есть возможность помогать тем, кого мы любим. Мы часто думаем, что если мы сможем просто получить правильную информацию, понять, что нужно сказать или сделать, возможно, что-то изменить в себе, мы сможем решить эту проблему. Люди должны быть в состоянии решить свои проблемы. Почему мы не можем сделать это с этим? Есть простая причина. НЕ сущестствует лекарства от зависимости. Требуется лечение. Процесс восстановления долгий и сложный.</p>\n<p>И есть только один человек кто может начать этот процесс: тот, кто использует Интернет и технологии навязчиво.</p>";

				const frontmatter = {"title":"Что делать, если ваш друг, или член семьи, интернет зависимый?","description":"Во-первых, никто не несет ответственности за чье-либо компульсивное использование Интернета и технологий. Как гласит лозунг Ал-Анона: «Я не вызвал это, я не могу контролировать это, и я не могу вылечить это».","pubDate":"08.14.22","img":"https://gorabbit.ru/wp-content/uploads/2019/10/А-что-скажут-люди-2048x1365.jpg","layout":"../../layout/Post.astro"};
				const file = "/Users/samgold/Desktop/Проекты/itaa/src/content/notes/chto-delat-esli-vash-drug-ili-chlen-semi-internet-zavisimyj.md";
				const url = undefined;
				function rawContent() {
					return "\nМы рады, что вы нашли эту страницу и слышите новость о том, что есть надежда для интернет-пользователей и пользователей технологий. Если вы близки к Интернет-зависимым, вы, вероятно, уже знаете о трудностях и боли, которые может вызвать это состояние, не только для самих зависимых, но и для окружающих их людей. Зависимость является серьезной проблемой, которая вредна для всех, кого она касается.\n\nВо-первых, никто не несет ответственности за чье-либо компульсивное использование Интернета и технологий. Как гласит лозунг Ал-Анона: «Я не вызвал это, я не могу контролировать это, и я не могу вылечить это».\n\nВы не вызвали это. Некоторые люди частично обвиняют себя в неблагополучном поведении членов своей семьи, особенно с зависимыми, которые очень быстро снимают с себя ответственность и обвиняют других. Возможно, вы проводили время в онлайне со своим любимым человеком, купили ему компьютер или смартфон или поощрили их занятия, думая, что это безобидный досуг. Возможно, вы были вовлечены в какой-то конфликт и хотите знать, не заставило ли это их спрятаться вашего зависимого в Интернете. Но никто не несет ответственности за поведение другого человека или психические расстройства.\n\nВы не можете это контролировать. Возможно, вы уже пытались поговорить со своим другом или членом семьи. Возможно, вы торговались с ними или ставили ультиматумы. Вы пытались помочь им увидеть, какой вред они наносят себе и другим. И ничего из этого не сработало. Это сбивает с толку вас. Почему они ничего не понимают и не заботятся о себе? Почему они не могут видеть то, что для вас очевидно? Это на самом деле симптом болезни зависимости.\n\nВы не можете вылечить это. Мы все хотели бы верить, что у нас есть возможность помогать тем, кого мы любим. Мы часто думаем, что если мы сможем просто получить правильную информацию, понять, что нужно сказать или сделать, возможно, что-то изменить в себе, мы сможем решить эту проблему. Люди должны быть в состоянии решить свои проблемы. Почему мы не можем сделать это с этим? Есть простая причина. НЕ сущестствует лекарства от зависимости. Требуется лечение. Процесс восстановления долгий и сложный.\n\nИ есть только один человек кто может начать этот процесс: тот, кто использует Интернет и технологии навязчиво.\n";
				}
				function compiledContent() {
					return html;
				}
				function getHeadings() {
					return [];
				}

				const Content = createComponent((result, _props, slots) => {
					const { layout, ...content } = frontmatter;
					content.file = file;
					content.url = url;

					return renderTemplate`${renderComponent(result, 'Layout', $$Post, {
								file,
								url,
								content,
								frontmatter: content,
								headings: getHeadings(),
								rawContent,
								compiledContent,
								'server:root': true,
							}, {
								'default': () => renderTemplate`${unescapeHTML(html)}`
							})}`;
				});

export { Content, compiledContent, Content as default, file, frontmatter, getHeadings, rawContent, url };
