import { d as createComponent, r as renderTemplate, g as renderComponent, u as unescapeHTML } from './astro_321cb245.mjs';
import 'clsx';
import { $ as $$Post } from './prerender_6e6735f4.mjs';
import 'html-escaper';
/* empty css                          *//* empty css                           */import './astro-assets-services_17197a4f.mjs';
/* empty css                                                               *//* empty css                                                               *//* empty css                                                             *//* empty css                                                             *//* empty css                         *//* empty css                            *//* empty css                          *//* empty css                                                               */
const html = "<h2 id=\"упражнение\">Упражнение.</h2>\n<p>Регулярные физические упражнения и физические движения улучшают здоровье, настроение и хорошее самочувствие. Занимаясь Интернет-технологиями, физические упражнения могут помочь вам выздороветь и повысить устойчивость. Вы можете регулярно гулять, бегать или кататься на велосипеде, заниматься спортом, танцевать или записаться на членство в местном спортзале.</p>\n<h2 id=\"живые-группы\">Живые группы.</h2>\n<p>Вместо того, чтобы связываться с вашим сообществом через социальные сети, наши участники стараются общаться с другими в реальной жизни. Общение с друзьями и семьей, участие в групповых мероприятиях или служение в наших сообществах может помочь ослабить изоляцию, которую усиливает наша зависимость.</p>\n<h2 id=\"спать\">Спать.</h2>\n<p>Для большинства интернет зависимых проблемы со сном. Наше «зависания» в интернете регулярно уносит нас далеко в ночь, и иногда мы можем заснуть только тогда, когда теряем сознание. Многие из нас могут быть хронически лишены сна, и возвращение к регулярному и полноценному графику сна является одной из лучших вещей, которые вы можете сделать для своего психического здоровья и выздоровления. Спать по 8 часов каждую ночь, ложиться спать и просыпаться в одно и то же время каждый день, а утренние и ночные занятия могут помочь установить лучшие привычки сна.</p>\n<h2 id=\"хобби-живые-увлечения-и-занятия\">Хобби, живые увлечения и занятия.</h2>\n<p>Многие участники, начав выздоравливать, сталкиваются с неудобным количеством свободного времени. Что нам делать со всем этим временем, если Интернет и технологии — это не вариант? Вложение нашего времени в хобби, увлечения и занятия в живую может помочь избавиться от скуки и вернуть смысл нашей жизни в отсутствие Интернета и технологий. Может быть полезно составить список здоровых форм отдыха и расслабления и ссылаться на него, когда мы изо всех сил пытаемся придумать, чем мы можем заниматься в автономном режиме в свободное время.</p>";

				const frontmatter = {"title":"Инструменты для полноценной жизни","description":"Вместо того, чтобы связываться с вашим сообществом через социальные сети, наши участники стараются общаться с другими в реальной жизни. Общение с друзьями и семьей, участие в групповых мероприятиях или служение в наших сообществах может помочь ослабить изоляцию, которую усиливает наша зависимость.","pubDate":"02.01.22","img":"https://www.soupstock.in/system/files/images/42/f5/shutterstock_223519156.jpg","layout":"../../layout/Post.astro"};
				const file = "/Users/samgold/Desktop/Проекты/itaa/src/content/notes/instrumenty-dlya-polnocennoj-zhizni.md";
				const url = undefined;
				function rawContent() {
					return "\n## Упражнение.\n\nРегулярные физические упражнения и физические движения улучшают здоровье, настроение и хорошее самочувствие. Занимаясь Интернет-технологиями, физические упражнения могут помочь вам выздороветь и повысить устойчивость. Вы можете регулярно гулять, бегать или кататься на велосипеде, заниматься спортом, танцевать или записаться на членство в местном спортзале.\n\n## Живые группы.\n\nВместо того, чтобы связываться с вашим сообществом через социальные сети, наши участники стараются общаться с другими в реальной жизни. Общение с друзьями и семьей, участие в групповых мероприятиях или служение в наших сообществах может помочь ослабить изоляцию, которую усиливает наша зависимость.\n\n## Спать.\n\nДля большинства интернет зависимых проблемы со сном. Наше «зависания» в интернете регулярно уносит нас далеко в ночь, и иногда мы можем заснуть только тогда, когда теряем сознание. Многие из нас могут быть хронически лишены сна, и возвращение к регулярному и полноценному графику сна является одной из лучших вещей, которые вы можете сделать для своего психического здоровья и выздоровления. Спать по 8 часов каждую ночь, ложиться спать и просыпаться в одно и то же время каждый день, а утренние и ночные занятия могут помочь установить лучшие привычки сна.\n\n## Хобби, живые увлечения и занятия.\n\nМногие участники, начав выздоравливать, сталкиваются с неудобным количеством свободного времени. Что нам делать со всем этим временем, если Интернет и технологии — это не вариант? Вложение нашего времени в хобби, увлечения и занятия в живую может помочь избавиться от скуки и вернуть смысл нашей жизни в отсутствие Интернета и технологий. Может быть полезно составить список здоровых форм отдыха и расслабления и ссылаться на него, когда мы изо всех сил пытаемся придумать, чем мы можем заниматься в автономном режиме в свободное время.\n";
				}
				function compiledContent() {
					return html;
				}
				function getHeadings() {
					return [{"depth":2,"slug":"упражнение","text":"Упражнение."},{"depth":2,"slug":"живые-группы","text":"Живые группы."},{"depth":2,"slug":"спать","text":"Спать."},{"depth":2,"slug":"хобби-живые-увлечения-и-занятия","text":"Хобби, живые увлечения и занятия."}];
				}

				const Content = createComponent((result, _props, slots) => {
					const { layout, ...content } = frontmatter;
					content.file = file;
					content.url = url;

					return renderTemplate`${renderComponent(result, 'Layout', $$Post, {
								file,
								url,
								content,
								frontmatter: content,
								headings: getHeadings(),
								rawContent,
								compiledContent,
								'server:root': true,
							}, {
								'default': () => renderTemplate`${unescapeHTML(html)}`
							})}`;
				});

export { Content, compiledContent, Content as default, file, frontmatter, getHeadings, rawContent, url };
